{
  "abate": "To become less intense or widespread.",
  "aberration": "A departure from what is normal, usual, or expected, typically one that is unwelcome.",
  "abhor": "To regard with disgust and hatred.",
  "abide": "To accept or act in accordance with a rule, decision, or recommendation.",
  "abject": "Experienced or present to the maximum degree (of something bad).",
  "abjure": "To solemnly renounce (a belief, cause, or claim).",
  "abnegation": "The act of renouncing or rejecting something.",
  "abode": "A place of residence; a house or home.",
  "abominable": "Causing moral revulsion.",
  "aboriginal": "Inhabiting or existing in a land from the earliest times or from before the arrival of colonists.",
  "abortive": "Failing to produce the intended result.",
  "abrade": "To scrape or wear away by friction or erosion.",
  "abrogate": "To repeal or do away with (a law, right, or formal agreement).",
  "abscond": "To leave hurriedly and secretly, typically to avoid detection of or arrest for an unlawful action.",
  "absolve": "To set or declare (someone) free from blame, guilt, or responsibility.",
  "abstain": "To restrain oneself from doing or enjoying something.",
  "abstemious": "Not self-indulgent, especially when eating and drinking.",
  "abstruse": "Difficult to understand; obscure.",
  "abysmal": "Extremely bad; appalling.",
  "accede": "To assent or agree to a demand, request, or treaty.",
  "accentuate": "To make more noticeable or prominent.",
  "acclaim": "To praise enthusiastically and publicly.",
  "acclimate": "To become accustomed to a new climate or to new conditions.",
  "accolade": "An award or privilege granted as a special honor or as an acknowledgment of merit.",
  "accord": "To give or grant someone (power, status, or recognition).",
  "accost": "To approach and address (someone) boldly or aggressively.",
  "accretion": "The process of growth or increase, typically by the gradual accumulation of additional layers or matter.",
  "acerbity": "Sharpness and directness in speech.",
  "acme": "The point at which someone or something is best, perfect, or most successful.",
  "acolyte": "A person assisting the celebrant in a religious service or a procession.",
  "acoustic": "Relating to sound or the sense of hearing.",
  "acquiesce": "To accept something reluctantly but without protest.",
  "acrimonious": "(typically of speech or a debate) angry and bitter.",
  "acumen": "The ability to make good judgments and quick decisions, typically in a particular domain.",
  "adage": "A proverb or short statement expressing a general truth.",
  "adamant": "Refusing to be persuaded or to change one's mind.",
  "addle": "To make unable to think clearly; confuse.",
  "adduce": "To cite as evidence.",
  "adept": "Very skilled or proficient at something.",
  "adhere": "To stick fast to (a surface or substance).",
  "admonish": "To warn or reprimand someone firmly.",
  "adroit": "Clever or skillful in using the hands or mind.",
  "adulation": "Obsequious flattery; excessive admiration or praise.",
  "adulterate": "To render (something) poorer in quality by adding another substance, typically an inferior one.",
  "adumbrate": "To report or represent in outline.",
  "advent": "The arrival of a notable person, thing, or event.",
  "adversary": "One's opponent in a contest, conflict, or dispute.",
  "adversity": "Difficulties; misfortune.",
  "advocate": "A person who publicly supports or recommends a particular cause or policy.",
  "aesthetic": "Concerned with beauty or the appreciation of beauty.",
  "affable": "Friendly, good-natured, or easy to talk to.",
  "affectation": "Behavior, speech, or writing that is artificial and designed to impress.",
  "affinity": "A spontaneous or natural liking or sympathy for someone or something.",
  "affluent": "(especially of a group or area) having a great deal of money; wealthy.",
  "affront": "An action or remark that causes outrage or offense.",
  "aggrandize": "To increase the power, status, or wealth of.",
  "aggrieve": "To cause to feel sorrow or trouble.",
  "aghast": "Filled with horror or shock.",
  "agile": "Able to move quickly and easily.",
  "agitate": "To make (someone) troubled or nervous.",
  "agnostic": "A person who believes that nothing is known or can be known of the existence or nature of God.",
  "agrarian": "Relating to cultivated land or the cultivation of land.",
  "alacrity": "Brisk and cheerful readiness.",
  "alchemy": "The medieval forerunner of chemistry, based on the supposed transformation of matter.",
  "alienate": "To cause (someone) to feel isolated or estranged.",
  "allay": "To diminish or put at rest (fear, suspicion, or worry).",
  "allege": "To claim or assert that someone has done something illegal or wrong, typically without proof that this is the case.",
  "allegiance": "Loyalty or commitment of a subordinate to a superior or of an individual to a group or cause.",
  "alleviate": "To make (suffering, deficiency, or a problem) less severe.",
  "allocate": "To distribute (resources or duties) for a particular purpose.",
  "allude": "To suggest or call attention to indirectly; hint at.",
  "allure": "The quality of being powerfully and mysteriously attractive or fascinating.",
  "altruism": "The belief in or practice of disinterested and selfless concern for the well-being of others.",
  "amalgamate": "To combine or unite to form one organization or structure.",
  "amass": "To gather together or accumulate (a large amount or number of valuable material or things) over a period of time.",
  "ambidextrous": "(of a person) able to use the right and left hands equally well.",
  "ambience": "The character and atmosphere of a place.",
  "ambiguous": "(of language) open to more than one interpretation; having a double meaning.",
  "ambivalent": "Having mixed feelings or contradictory ideas about something or someone.",
  "ameliorate": "To make (something bad or unsatisfactory) better.",
  "amenable": "(of a person) open and responsive to suggestion; easily persuaded or controlled.",
  "amiable": "Having or displaying a friendly and pleasant manner.",
  "amicable": "(of relations between people) having a spirit of friendliness; without serious disagreement.",
  "amiss": "Not quite right; inappropriate or out of place.",
  "amity": "A friendly relationship.",
  "amnesty": "An official pardon for people who have been convicted of political offenses.",
  "amorphous": "Without a clearly defined shape or form.",
  "amortize": "To gradually write off the initial cost of (an asset).",
  "amphibious": "Relating to, living in, or suited for both land and water.",
  "ample": "Enough or more than enough; plentiful.",
  "anachronism": "A thing belonging or appropriate to a period other than that in which it exists.",
  "analgesic": "Acting to relieve pain.",
  "analogous": "Comparable in certain respects, typically in a way that makes clearer the nature of the things compared.",
  "anarchy": "A state of disorder due to absence or nonrecognition of authority.",
  "anathema": "Something or someone that one vehemently dislikes.",
  "ancillary": "Providing necessary support to the primary activities or operation of an organization, institution, industry, or system.",
  "anecdote": "A short and amusing or interesting story about a real incident or person.",
  "anguish": "Severe mental or physical pain or suffering.",
  "animosity": "Strong hostility.",
  "annex": "To append or add as an extra or subordinate part.",
  "annihilate": "To destroy utterly; obliterate.",
  "annotate": "To add notes to (a text or diagram) giving explanation or comment.",
  "annul": "To declare invalid (an official agreement, decision, or result).",
  "anomalous": "Deviating from what is standard, normal, or expected.",
  "antagonism": "Active hostility or opposition.",
  "antecedent": "A thing or event that existed before or logically precedes another.",
  "antediluvian": "Of or belonging to the time before the biblical Flood.",
  "anthology": "A published collection of poems or other pieces of writing.",
  "anticipate": "To regard as probable; expect or predict.",
  "antipathy": "A deep-seated feeling of dislike; aversion.",
  "antiquated": "Old-fashioned or outdated.",
  "antithesis": "A person or thing that is the direct opposite of someone or something else.",
  "apathy": "Lack of interest, enthusiasm, or concern.",
  "apex": "The top or highest part of something, especially one forming a point.",
  "aphorism": "A pithy observation that contains a general truth.",
  "aplomb": "Self-confidence or assurance, especially when in a demanding situation.",
  "apocryphal": "(of a story or statement) of doubtful authenticity, although widely circulated as being true.",
  "apogee": "The highest point in the development of something; a climax or culmination.",
  "apologist": "A person who offers an argument in defense of something controversial.",
  "apostate": "A person who renounces a religious or political belief or principle.",
  "apotheosis": "The highest point in the development of something; culmination or climax.",
  "appall": "To greatly dismay or horrify.",
  "apparition": "A ghost or ghostlike image of a person.",
  "appease": "To pacify or placate (someone) by acceding to their demands.",
  "appellation": "A name or title.",
  "append": "To add (something) as an attachment or supplement.",
  "apposite": "Apt in the circumstances or in relation to something.",
  "appraise": "To assess the value or quality of.",
  "appreciable": "Large or important enough to be noticed.",
  "apprehend": "To arrest (someone) for a crime.",
  "approbation": "Approval or praise.",
  "appropriate": "Suitable or proper in the circumstances.",
  "appurtenance": "An accessory or other item associated with a particular activity or style of living.",
  "apropos": "With reference to; concerning.",
  "aptitude": "A natural ability to do something.",
  "aquiline": "Like an eagle.",
  "arable": "(of land) used or suitable for growing crops.",
  "arbiter": "A person who settles a dispute or has ultimate authority in a matter.",
  "arbitrary": "Based on random choice or personal whim, rather than any reason or system.",
  "arcane": "Understood by few; mysterious or secret.",
  "archaic": "Very old or old-fashioned.",
  "archetype": "A very typical example of a certain person or thing.",
  "ardent": "Enthusiastic or passionate.",
  "arduous": "Involving or requiring strenuous effort; difficult and tiring.",
  "arid": "(of land or a climate) having little or no rain; too dry or barren to support vegetation.",
  "aristocracy": "The highest class in certain societies, especially those holding hereditary titles or offices.",
  "armada": "A fleet of warships.",
  "articulate": "(of a person or a person's words) having or showing the ability to speak fluently and coherently.",
  "artifice": "Clever or cunning devices or expedients, especially as used to trick or deceive others.",
  "ascetic": "Characterized by severe self-discipline and abstention from all forms of indulgence, typically for religious reasons.",
  "ascribe": "To attribute something to (a cause).",
  "aseptic": "Free from contamination caused by harmful bacteria, viruses, or other microorganisms.",
  "aspersion": "An attack on the reputation or integrity of someone or something.",
  "aspire": "To direct one's hopes or ambitions towards achieving something.",
  "assail": "To make a concerted or violent attack on.",
  "assent": "The expression of approval or agreement.",
  "assert": "To state a fact or belief confidently and forcefully.",
  "assiduous": "Showing great care and perseverance.",
  "assimilate": "To take in (information, ideas, or culture) and understand fully.",
  "assuage": "To make (an unpleasant feeling) less intense.",
  "astringent": "Causing the contraction of skin cells and other body tissues.",
  "astute": "Having or showing an ability to accurately assess situations or people and turn this to one's advantage.",
  "asunder": "Apart; divided.",
  "atrophy": "(of body tissue or an organ) to waste away, especially as a result of the degeneration of cells, or become vestigial during evolution.",
  "attenuate": "To reduce the force, effect, or value of.",
  "attest": "To provide or serve as clear evidence of.",
  "atypical": "Not representative of a type, group, or class.",
  "audacious": "Showing a willingness to take surprisingly bold risks.",
  "augment": "To make (something) greater by adding to it; increase.",
  "augur": "(of an event or circumstance) to portend a good or bad outcome.",
  "austere": "Severe or strict in manner, attitude, or appearance.",
  "autonomy": "The right or condition of self-government.",
  "auxiliary": "Providing supplementary or additional help and support.",
  "avarice": "Extreme greed for wealth or material gain.",
  "aver": "To state or assert to be the case.",
  "aversion": "A strong dislike or disinclination.",
  "avid": "Having or showing a keen interest or enthusiasm for something.",
  "avow": "To assert or confess openly.",
  "avuncular": "Kind and friendly towards a younger or less experienced person.",
  "awry": "Away from the appropriate, planned, or expected course; amiss.",
  "axiom": "A statement or proposition that is regarded as being established, accepted, or self-evidently true.",
  
  "badinage": "Humorous or witty conversation.",
  "baffle": "To totally bewilder or perplex.",
  "bailiwick": "One's sphere of operations or particular area of interest.",
  "baleful": "Threatening harm; menacing.",
  "balk": "To hesitate or be unwilling to accept an idea or undertaking.",
  "ballast": "Heavy material, such as gravel, sand, or iron, placed in the bilge of a ship to ensure its stability.",
  "balm": "Something that has a comforting, soothing, or restorative effect.",
  "banal": "So lacking in originality as to be obvious and boring.",
  "bane": "A cause of great distress or annoyance.",
  "banter": "The playful and friendly exchange of teasing remarks.",
  "barbarous": "Savagely cruel; exceedingly brutal.",
  "bard": "A poet, traditionally one reciting epics and associated with a particular oral tradition.",
  "baroque": "Highly ornate and extravagant in style.",
  "barrage": "A concentrated artillery bombardment over a wide area.",
  "barren": "(of land) too poor to produce much or any vegetation.",
  "barricade": "An improvised barrier erected across a street or other thoroughfare to prevent or delay the movement of opposing forces.",
  "bask": "To lie exposed to warmth and light, typically from the sun, for relaxation and pleasure.",
  "bastion": "A projecting part of a fortification built at an angle to the line of a wall, so as to allow defensive fire in several directions.",
  "bawdy": "Dealing with sexual matters in a comical way; humorously indecent.",
  "beacon": "A fire or light set up in a high or prominent position as a warning, signal, or celebration.",
  "bedlam": "A scene of uproar and confusion.",
  "beget": "(typically of a man, sometimes of a man and a woman) to bring (a child) into existence by the process of reproduction.",
  "begrudge": "To envy (someone) the possession or enjoyment of (something).",
  "beguile": "To charm or enchant (someone), sometimes in a deceptive way.",
  "behemoth": "A huge or monstrous creature.",
  "beholden": "Owing thanks or having a duty to someone in return for help or a service.",
  "belabor": "To argue or elaborate (a subject) in excessive detail.",
  "belated": "Coming or happening later than should have been the case.",
  "beleaguer": "To lay siege to.",
  "belie": "(of an appearance) to fail to give a true notion or impression of (something); disguise or contradict.",
  "belittle": "To make (someone or something) seem unimportant.",
  "bellicose": "Demonstrating aggression and willingness to fight.",
  "belligerent": "Hostile and aggressive.",
  "bellow": "(of a person or animal) to emit a deep loud roar, typically in pain or anger.",
  "bellwether": "The leading sheep of a flock, with a bell on its neck.",
  "bemoan": "To express discontent or sorrow over (something).",
  "bemused": "Puzzled, confused, or bewildered.",
  "benchmark": "A standard or point of reference against which things may be compared or assessed.",
  "benefactor": "A person who gives money or other help to a person or cause.",
  "beneficent": "(of a person) generous or doing good.",
  "benevolent": "Well meaning and kindly.",
  "benign": "Gentle; kindly.",
  "bequeath": "To leave (a personal estate or one's body) to a person or other beneficiary by a will.",
  "berate": "To scold or criticize (someone) angrily.",
  "bereavement": "The action or condition of being bereaved.",
  "bereft": "Deprived of or lacking something, especially a non-material asset.",
  "beseech": "To ask (someone) urgently and fervently to do something; implore; entreat.",
  "beset": "(of a problem or difficulty) to trouble or threaten persistently.",
  "besiege": "To surround (a place) with armed forces in order to capture it or force its surrender.",
  "besmirch": "To damage the reputation of (someone or something) in the opinion of others.",
  "bestial": "Of or like an animal or animals.",
  "bestow": "To confer or present (an honor, right, or gift).",
  "betoken": "To be a sign of; indicate.",
  "betray": "To expose (one's country, a group, or a person) to danger by treacherously giving information to an enemy.",
  "betroth": "To enter into a formal agreement to marry.",
  "bevy": "A large group of people or things of a particular kind.",
  "bias": "Prejudice in favor of or against one thing, person, or group compared with another, usually in a way considered to be unfair.",
  "bicker": "To argue about petty and trivial matters.",
  "bifurcate": "To divide into two branches or forks.",
  "bigot": "A person who is intolerant toward those holding different opinions.",
  "bilious": "Affected by or associated with nausea or vomiting.",
  "bilk": "To obtain or withhold money from (someone) by deceit or without justification; cheat or defraud.",
  "billowing": "(of fabric) filled with air and swelling outward.",
  "bivouac": "A temporary camp without tents or cover, used especially by soldiers or mountaineers.",
  "bizarre": "Very strange or unusual, especially so as to cause interest or amusement.",
  "blanch": "To make white or pale by extracting color; bleach.",
  "blandishment": "A flattering or pleasing statement or action used to persuade someone gently to do something.",
  "blasphemy": "The act or offense of speaking sacrilegiously about God or sacred things; profane talk.",
  "blatant": "(of bad behavior) done openly and unashamedly.",
  "bleak": "(of an area of land) lacking vegetation and exposed to the elements.",
  "blight": "A plant disease, especially one caused by fungi such as mildews, rusts, and smuts.",
  "blithe": "Showing a casual and cheerful indifference considered to be callous or improper.",
  "bloated": "Swollen with fluid or gas.",
  "blockade": "An act or means of sealing off a place to prevent goods or people from entering or leaving.",
  "bludgeon": "A thick stick with a heavy end, used as a weapon.",
  "blunder": "A stupid or careless mistake.",
  "blunt": "(of a knife, pencil, etc.) having a worn-down edge or point; not sharp.",
  "blur": "A thing that cannot be seen or heard clearly.",
  "blurt": "To say (something) suddenly and without careful consideration.",
  "bode": "To be an omen of a particular outcome.",
  "bogus": "Not genuine or true; fake.",
  "boisterous": "(of a person, event, or behavior) noisy, energetic, and cheerful; rowdy.",
  "bolster": "To support or strengthen; prop up.",
  "bombast": "High-sounding language with little meaning, used to impress people.",
  "bombastic": "High-sounding but with little meaning; inflated.",
  "bonhomie": "Cheerful friendliness; geniality.",
  "boon": "A thing that is helpful or beneficial.",
  "boorish": "Rough and bad-mannered; coarse.",
  "bootless": "(of a task or undertaking) ineffectual; useless.",
  "botch": "To carry out (a task) badly or carelessly.",
  "bountiful": "Large in quantity; abundant.",
  "bourgeois": "Of or characteristic of the middle class, typically with reference to its perceived materialistic values or conventional attitudes.",
  "bovine": "Relating to or affecting cattle.",
  "bowdlerize": "To remove material that is considered improper or offensive from (a text or account), especially with the result that it becomes weaker or less effective.",
  "boycott": "To withdraw from commercial or social relations with (a country, organization, or person) as a punishment or protest.",
  "brackish": "(of water) slightly salty, as is the mixture of river water and seawater in estuaries.",
  "braggart": "A person who boasts about achievements or possessions.",
  "brandish": "To wave or flourish (something, especially a weapon) as a threat or in anger or excitement.",
  "bravado": "A bold manner or a show of boldness intended to impress or intimidate.",
  "brazen": "Bold and without shame.",
  "breach": "An act of breaking or failing to observe a law, agreement, or code of conduct.",
  "brevity": "Concise and exact use of words in writing or speech.",
  "bristle": "To stand upright away from the skin, especially in anger or fear.",
  "broach": "To raise (a sensitive or difficult subject) for discussion.",
  "bromide": "A trite and unoriginal idea or remark, typically intended to soothe or placate.",
  "brook": "To tolerate or allow (something, typically dissent or opposition).",
  "browbeat": "To intimidate (someone), typically into doing something, with stern or abusive words.",
  "brusque": "Abrupt or offhand in speech or manner.",
  "bucolic": "Relating to the pleasant aspects of the countryside and country life.",
  "buffoon": "A ridiculous but amusing person; a clown.",
  "bulwark": "A defensive wall.",
  "bumptious": "Self-important or proud to an irritating degree.",
  "bungle": "To carry out (a task) clumsily or incompetently.",
  "buoyant": "Able or apt to stay afloat or rise to the top of a liquid or gas.",
  "burgeon": "To begin to grow or increase rapidly; flourish.",
  "burlesque": "An absurd or comically exaggerated imitation of something, especially in a literary or dramatic work.",
  "burnish": "To polish (something, especially metal) by rubbing.",
  "buttress": "To provide (a building or structure) with projecting supports built against its walls.",
    "cacophony": "A mix of loud, unpleasant sounds.",
  "cadence": "The rhythmic flow of a sequence of sounds or words.",
  "cajole": "To persuade someone to do something by being nice or flattering.",
  "calamity": "A terrible event that causes a lot of damage; a disaster.",
  "callous": "Not caring about other people's feelings or pain.",
  "callow": "Young and inexperienced.",
  "calumny": "False statements made to damage someone's reputation.",
  "camaraderie": "Friendship and trust among a group of people.",
  "candid": "Truthful and direct; hiding nothing.",
  "candor": "The quality of being open and honest.",
  "canine": "Relating to dogs.",
  "cantankerous": "Bad-tempered, argumentative, and uncooperative.",
  "capitulate": "To stop fighting and surrender.",
  "capricious": "Changing mood or behavior suddenly and unexpectedly.",
  "captious": "Tending to find fault or complain about small things.",
  "cardinal": "Of the most importance; fundamental.",
  "carnage": "The killing of a large number of people.",
  "carping": "Constantly complaining about small, unimportant things.",
  "castigate": "To criticize or punish someone severely.",
  "cataclysm": "A violent event that causes great change or destruction.",
  "catalyst": "Something or someone that causes a change or event to happen.",
  "categorical": "Absolute and clear; without any doubt.",
  "catharsis": "The release of strong emotions, bringing relief.",
  "catholic": "Including a wide variety of things; all-embracing.",
  "caustic": "Sarcastic in a bitter or hurtful way.",
  "cavalier": "Showing a lack of concern for important matters.",
  "cavil": "To complain about unnecessary or small details.",
  "cede": "To give up power or territory to someone else.",
  "celerity": "Swiftness of movement; speed.",
  "celestial": "Relating to the sky or outer space.",
  "censure": "To formally express severe disapproval of someone.",
  "centrifugal": "Moving away from the center.",
  "centripetal": "Moving toward the center.",
  "cerebral": "Relating to the brain or intellect rather than emotions.",
  "cerulean": "Deep blue in color, like a clear sky.",
  "cessation": "The process of ending or stopping.",
  "chafe": "To become annoyed or impatient because of a restriction.",
  "chaff": "Things that are worthless; trash.",
  "chagrin": "A feeling of embarrassment or failure.",
  "chameleon": "A person who changes their behavior to fit the situation.",
  "champion": "To defend or support a cause or person.",
  "chaotic": "In a state of complete confusion and disorder.",
  "charisma": "A special charm that attracts and inspires others.",
  "charlatan": "A person who falsely claims to have special skills; a fraud.",
  "chary": "Cautious or suspicious about doing something.",
  "chasm": "A deep gap or hole in the earth.",
  "chassis": "The base frame of a car or vehicle.",
  "chaste": "Pure; refraining from sexual activity.",
  "chastise": "To scold or punish severely.",
  "chauvinist": "A person who believes their group or country is superior to others.",
  "checkered": "Marked by both good and bad luck or events.",
  "cherubic": "Having the innocent, chubby face of a child or angel.",
  "chicanery": "Trickery or deception used to achieve a goal.",
  "chide": "To scold or correct someone gently.",
  "chimerical": "Imaginary or impossible; existing only in the mind.",
  "chivalrous": "Polite, brave, and respectful, especially towards women.",
  "choleric": "Easily angered; bad-tempered.",
  "choreography": "The art of creating dance steps and movements.",
  "chronic": "Lasting for a long time or constantly recurring.",
  "chronicle": "A factual written record of historical events.",
  "circuitous": "Longer than the direct way; roundabout.",
  "circumlocution": "Using too many words to be vague or evasive.",
  "circumscribe": "To limit or restrict something.",
  "circumspect": "Cautious and unwilling to take risks.",
  "circumvent": "To find a way around an obstacle or rule.",
  "citadel": "A fortress protecting a city.",
  "cite": "To quote something as evidence or proof.",
  "civil": "Polite and courteous, but not necessarily friendly.",
  "clairvoyant": "Having the ability to see the future.",
  "clamor": "A loud and confused noise, usually people shouting.",
  "clandestine": "Kept secret or done secretively.",
  "clangor": "A continuous loud banging or ringing sound.",
  "clarify": "To make something easier to understand.",
  "clarity": "The quality of being clear and easy to see or understand.",
  "cleave": "To split or cut something apart.",
  "clemency": "Mercy or lenience shown to someone who has done wrong.",
  "cliché": "A phrase or idea that is overused and unoriginal.",
  "clientele": "The customers of a shop or business.",
  "climactic": "The most exciting or important part of a story or event.",
  "clique": "A small group of people who do not easily allow others to join.",
  "cloister": "To shut away or seclude from the world.",
  "cloture": "A procedure for ending a debate and taking a vote.",
  "coalesce": "To come together to form one mass or whole.",
  "coerce": "To force someone to do something by using threats.",
  "cogent": "Clear, logical, and convincing.",
  "cogitate": "To think deeply about something.",
  "cognizant": "Being aware of or having knowledge of something.",
  "cohere": "To stick together; to be united.",
  "cohort": "A group of people with a shared characteristic.",
  "coiffure": "A person's hairstyle.",
  "coincide": "To happen at the same time.",
  "collaborate": "To work together to create something.",
  "collage": "Art made by sticking different materials onto a surface.",
  "collate": "To collect and arrange information in the correct order.",
  "collateral": "Something of value promised to a lender if a loan is not repaid.",
  "colloquial": "Language used in ordinary conversation; not formal.",
  "collusion": "Secret or illegal cooperation to cheat others.",
  "colossus": "A person or thing of enormous size or importance.",
  "comatose": "In a state of deep unconsciousness.",
  "combustion": "The process of burning.",
  "commemorate": "To honor the memory of a person or event.",
  "commensurate": "Corresponding in size or degree; in proportion.",
  "commiserate": "To express sympathy or pity for someone.",
  "commodious": "Roomy and comfortable.",
  "communal": "Shared by all members of a community.",
  "compact": "Closely and neatly packed together.",
  "compatible": "Able to exist or work together without conflict.",
  "compelling": "Evoking interest, attention, or admiration in a powerful way.",
  "compendium": "A collection of concise but detailed information about a subject.",
  "complacent": "Satisfied with oneself and not wanting to try harder.",
  "complaisant": "Willing to please others; agreeable.",
  "complement": "Something that completes or brings to perfection.",
  "compliant": "Inclined to agree with others or obey rules.",
  "complicity": "Involvement in doing something wrong or illegal.",
  "compliment": "A polite expression of praise or admiration.",
  "comply": "To act according to a rule or command.",
  "composure": "The state of being calm and in control of oneself.",
  "compound": "To make something worse; to mix things together.",
  "comprehensive": "Complete; including all or nearly all elements.",
    "dearth": "A shortage or lack of something.",
  "debacle": "A sudden and shameful failure; a fiasco.",
  "debase": "To reduce the quality or value of something.",
  "debilitate": "To make someone weak and infirm.",
  "debonair": "Confident, stylish, and charming (usually a man).",
  "debunk": "To expose the falseness of a myth or belief.",
  "debutante": "A young upper-class woman making her first appearance in society.",
  "decadence": "Moral or cultural decline due to excessive indulgence in pleasure.",
  "decimate": "To kill, destroy, or remove a large percentage of.",
  "decipher": "To succeed in understanding or interpreting something difficult.",
  "decorum": "Behavior in keeping with good taste and propriety.",
  "decrepit": "Old and in poor condition.",
  "decry": "To publicly criticize or denounce.",
  "deduce": "To arrive at a conclusion by reasoning.",
  "defame": "To damage the good reputation of someone; slander.",
  "default": "Failure to fulfill an obligation, especially to repay a loan.",
  "defer": "To put off (an action) to a later time; postpone.",
  "deference": "Humble submission and respect.",
  "defiant": "Showing open resistance or disobedience.",
  "deficient": "Not having enough of a specified quality or ingredient.",
  "deficit": "The amount by which something is too small.",
  "defile": "To spoil the purity or appearance of something.",
  "definitive": "Conclusive; providing a final solution.",
  "deflect": "To cause something to change direction.",
  "deft": "Neatly skillful and quick in one's movements.",
  "defunct": "No longer existing or functioning.",
  "defy": "To openly resist or refuse to obey.",
  "degenerate": "To decline or deteriorate physically, mentally, or morally.",
  "dehydrate": "To lose a large amount of water from the body.",
  "deify": "To worship or treat like a god.",
  "deign": "To do something that one considers beneath one's dignity.",
  "deity": "A god or goddess.",
  "dejected": "Sad and depressed; dispirited.",
  "deleterious": "Causing harm or damage.",
  "delineate": "To describe or portray something precisely.",
  "delinquent": "Showing a tendency to commit crime (usually a young person).",
  "delirious": "In a disturbed state of mind resulting from illness or intoxication.",
  "delude": "To impose a misleading belief upon someone; deceive.",
  "deluge": "A severe flood or a great quantity of something arriving at once.",
  "delusion": "A false belief or opinion.",
  "demagogue": "A political leader who seeks support by appealing to desires rather than reason.",
  "demeanor": "Outward behavior or bearing.",
  "demise": "A person's death.",
  "demography": "The study of statistics such as births, deaths, income, etc.",
  "demolition": "The action of knocking down or destroying a building.",
  "demonstrative": "Openly expressing emotion.",
  "demote": "To give someone a lower rank or less senior position.",
  "demur": "To raise doubts or show reluctance.",
  "demure": "Reserved, modest, and shy (typically a woman).",
  "denigrate": "To criticize unfairly; disparage.",
  "denizen": "An inhabitant or occupant of a particular place.",
  "denounce": "To publicly declare to be wrong or evil.",
  "depict": "To show or represent by a drawing, painting, or other art form.",
  "deplete": "To use up the supply or resources of.",
  "deplore": "To feel or express strong disapproval of something.",
  "deploy": "To move troops or equipment into position for military action.",
  "depose": "To remove from office suddenly and forcefully.",
  "depravity": "Moral corruption; wickedness.",
  "deprecate": "To express disapproval of.",
  "depreciate": "To diminish in value over time.",
  "derelict": "In a very poor condition as a result of disuse and neglect.",
  "deride": "To express contempt for; ridicule.",
  "derivative": "Imitative of the work of another person; not original.",
  "derogatory": "Showing a critical or disrespectful attitude.",
  "desecrate": "To treat a sacred place or thing with violent disrespect.",
  "desiccate": "To remove the moisture from something; dry out.",
  "desolate": "Empty of people; deserted and bleak.",
  "despair": "The complete loss or absence of hope.",
  "despicable": "Deserving hatred and contempt.",
  "despondent": "In low spirits from loss of hope or courage.",
  "despot": "A ruler with absolute power, typically one who uses it cruelly.",
  "destitute": "Without the basic necessities of life.",
  "desultory": "Lacking a plan, purpose, or enthusiasm.",
  "detach": "To disengage something and remove it.",
  "deter": "To discourage someone from doing something through fear of consequences.",
  "deteriorate": "To become progressively worse.",
  "determinate": "Having exact and discernible limits or form.",
  "detriment": "The state of being harmed or damaged.",
  "deviate": "To depart from an established course or standard.",
  "devious": "Showing a skillful use of underhanded tactics to achieve goals.",
  "devoid": "Entirely lacking or free from.",
  "devout": "Having or showing deep religious feeling or commitment.",
  "dexterity": "Skill in performing tasks, especially with the hands.",
  "diabolic": "Disgracefully bad or unpleasant; devilish.",
  "diadem": "A jeweled crown or headband worn as a symbol of sovereignty.",
  "diagnose": "To identify the nature of an illness or problem.",
  "diagonal": "Joining two opposite corners of a square or rectangle.",
  "dialect": "A particular form of a language that is peculiar to a specific region.",
  "dialogue": "Conversation between two or more people.",
  "diaphanous": "Light, delicate, and translucent.",
  "iatribe": "A forceful and bitter verbal attack against someone or something.",
  "dichotomy": "A division between two things that are represented as being opposed.",
  "dictum": "A formal pronouncement from an authoritative source.",
  "didactic": "Intended to teach, particularly in having moral instruction.",
  "diffident": "Modest or shy because of a lack of self-confidence.",
  "diffuse": "Spread out over a large area; not concentrated.",
  "digress": "To leave the main subject temporarily in speech or writing.",
  "dilapidated": "In a state of disrepair or ruin as a result of age or neglect.",
  "dilate": "To make or become wider, larger, or more open.",
  "dilatory": "Slow to act; intended to cause delay.",
  "dilemma": "A situation in which a difficult choice has to be made.",
  "dilettante": "A person who cultivates an area of interest without real commitment or knowledge.",
    "ebullient": "Cheerful and full of energy.",
  "eccentric": "Unconventional and slightly strange behavior.",
  "echelon": "A level or rank in an organization or society.",
  "eclectic": "Deriving ideas or style from a broad and diverse range of sources.",
  "eclipse": "To obscure the light of; to make less important.",
  "economy": "Careful management of available resources.",
  "ecstasy": "An overwhelming feeling of great happiness.",
  "edict": "An official order or proclamation issued by a person in authority.",
  "edify": "To instruct or improve someone morally or intellectually.",
  "eerie": "Strange and frightening.",
  "efface": "To erase (a mark) from a surface; to make oneself appear insignificant.",
  "effectual": "Successful in producing a desired or intended result.",
  "effervescent": "Vivacious and enthusiastic; bubbly.",
  "efficacious": "Successful in producing a desired or intended result; effective.",
  "effigy": "A sculpture or model of a person.",
  "effrontery": "Insolent or impertinent behavior.",
  "effulgent": "Shining brightly; radiant.",
  "egalitarian": "Believing in the principle that all people are equal.",
  "egocentric": "Thinking only of oneself, without regard for the feelings of others.",
  "egregious": "Outstandingly bad; shocking.",
  "egress": "The action of going out of or leaving a place.",
  "elaboration": "The addition of more detail concerning what has already been said.",
  "elated": "Ecstatically happy.",
  "elegy": "A poem of serious reflection, typically a lament for the dead.",
  "elicit": "To evoke or draw out (a response or fact) from someone.",
  "elite": "A select group that is superior in terms of ability or qualities.",
  "elocution": "The skill of clear and expressive speech.",
  "elucidate": "To make something clear; explain.",
  "elusive": "Difficult to find, catch, or achieve.",
  "emaciated": "Abnormally thin or weak, especially because of illness or a lack of food.",
  "emanate": "To issue or spread out from (a source).",
  "emancipate": "To set free, especially from legal, social, or political restrictions.",
  "emasculate": "To deprive (a man) of his male role or identity.",
  "embargo": "An official ban on trade or other commercial activity with a particular country.",
  "embark": "To go on board a ship, aircraft, or other vehicle; to begin a course of action.",
  "embed": "To fix (an object) firmly and deeply in a surrounding mass.",
  "embellish": "To make something more attractive by the addition of decorative details.",
  "embezzle": "To steal or misappropriate (money placed in one's trust).",
  "emblem": "A heraldic device or symbolic object as a distinctive badge of a nation, organization, or family.",
  "embody": "To give a tangible or visible form to (an idea, quality, or feeling).",
  "emboss": "To carve, mold, or stamp a design on (a surface) so that it stands out in relief.",
  "embroil": "To involve (someone) deeply in an argument, conflict, or difficult situation.",
  "embryonic": "In a new or elementary stage of development.",
  "emend": "To make corrections and improvements to (a text).",
  "emerge": "To move out of or away from something and come into view.",
  "emigrate": "To leave one's own country in order to settle permanently in another.",
  "eminent": "(of a person) famous and respected within a particular sphere or profession.",
  "emissary": "A person sent on a special mission, usually as a diplomatic representative.",
  "emit": "To produce and discharge (something, especially gas or radiation).",
  "emollient": "Having the quality of softening or soothing the skin.",
  "emolument": "A salary, fee, or profit from employment or office.",
  "empathy": "The ability to understand and share the feelings of another.",
  "emphatic": "Showing or giving emphasis; expressing something forcibly and clearly.",
  "empirical": "Based on, concerned with, or verifiable by observation or experience rather than theory.",
  "emulate": "To match or surpass (a person or achievement), typically by imitation.",
  "enamored": "Be filled with a feeling of love for.",
  "encapsulate": "To express the essential features of (something) succinctly.",
  "enchant": "To fill (someone) with great delight; charm.",
  "enclave": "A portion of territory within or surrounded by a larger territory whose inhabitants are culturally or ethnically distinct.",
  "encomium": "A speech or piece of writing that praises someone or something highly.",
  "encompass": "To surround and have or hold within.",
  "encroach": "To intrude on (a person's territory or rights).",
  "encumbrance": "A burden or impediment.",
  "encyclopedic": "Comprehensive in terms of information.",
  "endear": "To cause to be loved or liked.",
  "endemic": "(of a disease or condition) regularly found among particular people or in a certain area.",
  "endorse": "To declare one's public approval or support of.",
  "endow": "To give or bequeath an income or property to (a person or institution).",
  "endure": "To suffer (something painful or difficult) patiently.",
  "enervate": "To cause (someone) to feel drained of energy or vitality.",
  "enfranchise": "To give the right to vote to.",
  "engage": "To occupy, attract, or involve (someone's interest or attention).",
  "engender": "To cause or give rise to (a feeling, situation, or condition).",
  "engross": "To absorb all the attention or interest of.",
  "enhance": "To intensify, increase, or further improve the quality, value, or extent of.",
  "enigma": "A person or thing that is mysterious, puzzling, or difficult to understand.",
  "enjoin": "To instruct or urge (someone) to do something.",
  "enlighten": "To give (someone) greater knowledge and understanding about a subject or situation.",
  "enlist": "To enroll or be enrolled in the armed services.",
  "enmity": "The state or feeling of being actively opposed or hostile to someone or something.",
  "ennui": "A feeling of listlessness and dissatisfaction arising from a lack of occupation or excitement.",
  "enormity": "The great or extreme scale, seriousness, or extent of something perceived as bad or morally wrong.",
  "enrapture": "To give intense pleasure or joy to.",
  "ensconce": "To establish or settle (someone) in a comfortable, safe, or secret place.",
  "ensemble": "A group of musicians, actors, or dancers who perform together.",
  "entail": "To involve (something) as a necessary or inevitable part or consequence.",
  "entangle": "To cause to become twisted together with or caught in.",
  "enterprising": "Having or showing initiative and resourcefulness.",
  "enthrall": "To capture the fascinated attention of.",
  "entice": "To attract or tempt by offering pleasure or advantage.",
  "entity": "A thing with distinct and independent existence.",
  "entomology": "The branch of zoology concerned with the study of insects.",
  "entourage": "A group of people attending or surrounding an important person.",
  "entrancing": "Capable of attracting and holding interest; charming.",
  "entreat": "To ask someone earnestly or anxiously to do something.",
  "entrench": "To establish (an attitude, habit, or belief) so firmly that change is very difficult or unlikely.",
  "entrepreneur": "A person who organizes and operates a business or businesses, taking on greater than normal financial risks in order to do so.",
  "enumerate": "To mention (a number of things) one by one.",
  "enunciate": "To say or pronounce clearly.",
  "envision": "To imagine as a future possibility; visualize.",
  "ephemeral": "Lasting for a very short time.",
  "epic": "A long poem, typically one derived from ancient oral tradition, narrating the deeds and adventures of heroic or legendary figures.",
  "epicure": "A person who takes particular pleasure in fine food and drink.",
  "epigram": "A pithy saying or remark expressing an idea in a clever and amusing way.",
  "epiphany": "A moment of sudden revelation or insight.",
  "epitaph": "A phrase or statement written in memory of a person who has died, especially as an inscription on a tombstone.",
  "epitome": "A person or thing that is a perfect example of a particular quality or type.",
  "epoch": "A period of time in history or a person's life, typically one marked by notable events or particular characteristics.",
  "equanimity": "Mental calmness, composure, and evenness of temper, especially in a difficult situation.",
  "equilibrium": "A state in which opposing forces or influences are balanced.",
  "equitable": "Fair and impartial.",
  "equivocal": "Open to more than one interpretation; ambiguous.",
  "eradicate": "To destroy completely; put an end to.",
  "erode": "To gradually wear away or destroy.",
  "erratic": "Not even or regular in pattern or movement; unpredictable.",
  "erroneous": "Wrong; incorrect.",
  "erudite": "Having or showing great knowledge or learning.",
  "escalate": "To increase rapidly.",
  "escapade": "An act or incident involving excitement, daring, or adventure.",
  "eschew": "To deliberately avoid using; abstain from.",
  "esoteric": "Intended for or likely to be understood by only a small number of people with a specialized knowledge or interest.",
  "espouse": "To adopt or support (a cause, belief, or way of life).",
  "esteem": "Respect and admiration, typically for a person.",
  "estrange": "To cause (someone) to be no longer close or affectionate to someone; alienate.",
  "ethereal": "Extremely delicate and light in a way that seems too perfect for this world.",
  "ethics": "Moral principles that govern a person's behavior or the conducting of an activity.",
  "ethnic": "Relating to a population subgroup (within a larger or dominant national or cultural group) with a common national or cultural tradition.",
  "etiquette": "The customary code of polite behavior in society or among members of a particular profession or group.",
  "etymology": "The study of the origin of words and the way in which their meanings have changed throughout history.",
  "eulogy": "A speech or piece of writing that praises someone or something highly, typically someone who has just died.",
  "euphemism": "A mild or indirect word or expression substituted for one considered to be too harsh or blunt.",
  "euphoria": "A feeling or state of intense excitement and happiness.",
  "evanescent": "Soon passing out of sight, memory, or existence; quickly fading or disappearing.",
  "evasive": "Tending to avoid commitment or self-revelation, especially by responding only indirectly.",
  "evince": "To reveal the presence of (a quality or feeling).",
  "evoke": "To bring or recall to the conscious mind.",
  "exacerbate": "To make (a problem, bad situation, or negative feeling) worse.",
  "exacting": "Making great demands on one's skill, attention, or other resources.",
  "exalt": "To hold (someone or something) in very high regard; think or speak very highly of.",
  "exasperate": "To irritate and frustrate (someone) intensely.",
  "excavate": "To make (a hole or channel) by digging.",
  "exceed": "To go beyond what is allowed or stipulated by (a set limit).",
  "excel": "To be exceptionally good at or proficient in an activity or subject.",
  "exceptionable": "Open to objection; causing disapproval or offense.",
  "excerpt": "A short extract from a film, broadcast, or piece of music or writing.",
  "excessive": "More than is necessary, normal, or desirable; immoderate.",
  "exchange": "An act of giving one thing and receiving another (especially of the same type or value) in return.",
  "excise": "To cut out surgically.",
  "exclaim": "To cry out suddenly, especially in surprise, anger, or pain.",
  "exclude": "To deny (someone) access to or bar (someone) from a place, group, or privilege.",
  "exclusive": "Restricted or limited to the person, group, or area concerned.",
  "excommunicate": "To officially exclude (someone) from participation in the sacraments and services of the Christian Church.",
  "excoriate": "To censure or criticize severely.",
  "exculpate": "To show or declare that (someone) is not guilty of wrongdoing.",
  "execrable": "Extremely bad or unpleasant.",
  "exemplary": "Serving as a desirable model; representing the best of its kind.",
  "exempt": "Free from an obligation or liability imposed on others.",
  "exert": "To apply or bring to bear (a force, influence, or quality).",
  "exhale": "To breathe out.",
  "exhaust": "To drain (someone) of their physical or mental resources; tire out.",
  "exhibit": "To manifest or deliberately display (a quality or type of behavior).",
  "exhilarate": "To make (someone) feel very happy, animated, or elated.",
  "exhort": "To strongly encourage or urge (someone) to do something.",
  "exhume": "To dig out (something buried, especially a corpse) from the ground.",
  "exigent": "Pressing; demanding.",
  "exile": "The state of being barred from one's native country, typically for political or punitive reasons.",
  "existential": "Concerned with existence, especially human existence.",
  "exodus": "A mass departure of people, especially emigrants.",
  "exonerate": "To absolve (someone) from blame for a fault or wrongdoing.",
  "exorbitant": "(of a price or amount charged) unreasonably high.",
  "exorcise": "To drive out or attempt to drive out (an evil spirit) from a person or place.",
  "exotic": "Originating in or characteristic of a distant foreign country.",
  "expand": "To become or make larger or more extensive.",
  "expanse": "An area of something, typically land or sea, presenting a wide continuous surface.",
  "expatiate": "To speak or write at length or in detail.",
  "expatriate": "A person who lives outside their native country.",
  "expect": "To regard (something) as likely to happen.",
  "expedient": "(of an action) convenient and practical although possibly improper or immoral.",
  "expedite": "To make (an action or process) happen sooner or be accomplished more quickly.",
  "expel": "To deprive (someone) of membership of or involvement in a school or other organization.",
  "expendable": "Of little significance when compared to an overall purpose, and therefore able to be abandoned.",
  "expert": "A person who has a comprehensive and authoritative knowledge of or skill in a particular area.",
  "expiate": "To atone for (guilt or sin).",
  "expiration": "The ending of the fixed period for which a contract is valid.",
  "explain": "To make (an idea, situation, or problem) clear to someone by describing it in more detail or revealing relevant facts or ideas.",
  "expletive": "An oath or swear word.",
  "explicate": "To analyze and develop (an idea or principle) in detail.",
  "explicit": "Stated clearly and in detail, leaving no room for confusion or doubt.",
  "explode": "To burst or shatter violently and noisily as a result of rapid combustion, decomposition, excessive internal pressure, or other process.",
  "exploit": "To make full use of and derive benefit from (a resource).",
  "explore": "To travel in or through (an unfamiliar country or area) in order to learn about or familiarize oneself with it.",
  "exponent": "A person who believes in and promotes the truth or benefits of an idea or theory.",
  "export": "To send (goods or services) to another country for sale.",
  "expose": "To make (something) visible by uncovering it.",
  "exposit": "To state or explain (a theory or idea) in detail.",
  "expostulate": "To express strong disapproval or disagreement.",
  "exposure": "The state of being exposed to contact with something.",
  "expound": "To present and explain (a theory or idea) systematically and in detail.",
  "express": "To convey (a thought or feeling) in words or by gestures and conduct.",
  "expropriate": "(especially of the state) to take away (property) from its owner.",
  "expunge": "To erase or remove completely (something unwanted or unpleasant).",
  "expurgate": "To remove matter thought to be objectionable or unsuitable from (a text or account).",
  "exquisite": "Extremely beautiful and, typically, delicate.",
  "extant": "(especially of a document) still in existence; surviving.",
  "extemporaneous": "Spoken or done without preparation.",
  "extend": "To cause to cover a larger area; make longer or wider.",
  "extenuate": "To make (guilt or an offense) seem less serious or more forgivable.",
  "exterior": "Forming, situated on, or relating to the outside of something.",
  "exterminate": "To destroy completely.",
  "external": "Belonging to or forming the outer surface or structure of something.",
  "extinct": "(of a species, family, or other larger group) having no living members.",
  "extinguish": "To cause (a fire or light) to cease to burn or shine.",
  "extol": "To praise enthusiastically.",
  "extort": "To obtain (something) by force, threats, or other unfair means.",
  "extra": "Added to an existing or usual amount or number.",
  "extract": "To remove or take out, especially by effort or force.",
  "extraneous": "Irrelevant or unrelated to the subject being dealt with.",
  "extraordinary": "Very unusual or remarkable.",
  "extrapolate": "To extend the application of (a method or conclusion, especially one based on statistics) to an unknown situation by assuming that existing trends will continue or similar methods will be applicable.",
  "extravagant": "Lacking restraint in spending money or using resources.",
  "extreme": "Reaching a high or the highest degree.",
  "extricate": "To free (someone or something) from a constraint or difficulty.",
  "extrinsic": "Not part of the essential nature of someone or something; coming or operating from outside.",
  "extrovert": "An outgoing, overtly expressive person.",
  "exuberant": "Filled with or characterized by a lively energy and excitement.",
  "exude": "(of a person) to display (an emotion or quality) strongly and openly.",
  "exult": "To show or feel elation or jubilation, especially as the result of a success."





}
